Table of Contents
 Enum WeldEvaluation
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
WeldEvaluation
public enum WeldEvaluation
Fields
ApplyPlasticWelds = 4
Plasticity in welds is taken into account in AM
ForceResultant = 1
Check is calculated as resultant of all forces in weld
MaxForceElement = 0
Check is calculated in element with max force in weld (too conservative)
Fields
 Name |  Description
 ApplyPlasticWelds = 4
Plasticity in welds is taken into account in AM
 ForceResultant = 1
Check is calculated as resultant of all forces in weld
 MaxForceElement = 0
Check is calculated in element with max force in weld (too conservative)
 Edit this page